k6-artillery/upload-test.yaml
config:
  target: "http://localhost:5009"
  phases:
    - duration: 30
      arrivalRate: 3
  payload:
    path: "files.csv"
    fields:
      - "filePath"
  http:
    multipart: true

scenarios:
  - name: Upload car image
    flow:
      - post:
          url: "/v1/car-image/upload"
          headers:
            Authorization: "Bearer YOUR_VALID_TOKEN_HERE"
          formData:
            file: "{{ filePath }}"